'use strict';

/** @type {import('sequelize-cli').Migration} */
module.exports = {
  async up (queryInterface, Sequelize) {
    /**
     * Add seed commands here.
     *
     * Example:
     * await queryInterface.bulkInsert('People', [{
     *   name: 'John Doe',
     *   isBetaMember: false
     * }], {});
    */
    await queryInterface.bulkInsert('students', 
    [
      {id:"5335",ime:"Петар",prezime:"Бојовић",smerID:"215",zvanje:"Мастер инжењер електротехнике и рачунарства",godina:"2008",mentor:"Др Стеван Милинковић",tema_rada:"VOIP телефонија базирана на Asterisk платформи"},
      {id:"5515",ime:"Петар",prezime:"Првуловић",smerID:"213",zvanje:"Мастер информатичар",godina:"2017",mentor:"др Душан Вујошевић",tema_rada:"Развој аналитичког решења класификатора текстуалних докумената и повећање његове употребљивости експонирањем <b>Najm<\/b> модела <b>Restful<\/b> сервиса"},
      {id:"5607",ime:"Станко",prezime:"Милосављевић",smerID:"211",zvanje:"Дипломирани инжењер рачунарства",godina:"2014",mentor:"Др Видаковић Милан",tema_rada:"WЕБ апликација за студентски сервис"},
      {id:"5609",ime:"Мартин",prezime:"Јонџић",smerID:"211",zvanje:"Дипломирани инжењер рачунарства",godina:"2014",mentor:"Др Видаковић Милан",tema_rada:"Кохезија у објектно оријентисаном програмирању"},
      {id:"5610",ime:"Никола",prezime:"Пашић",smerID:"211",zvanje:"Дипломирани информатичар",godina:"2014",mentor:"Др Милан Видаковић",tema_rada:"Развој <b>plugin-ova<\/b> за <b>Wordpress<\/b>"},
      {id:"5611",ime:"Александар",prezime:"Богдановић",smerID:"211",zvanje:"Дипломирани информатичар",godina:"2014",mentor:"Др Стеван Милинковић",tema_rada:"<b>Ul framework<\/b> za programski jezik <b>HAXE<\/b>"},
      {id:"5685",ime:"Владимир",prezime:"Стевановић",smerID:"212",zvanje:"Дипломирани инжењер електротехнике и рачунарства",godina:"2014",mentor:"Др Ђорђе Бабић",tema_rada:"Алати за симулацију рачунарских мрежа у едукацији и истраживању - НСЗ"},
      {id:"5686",ime:"Никола",prezime:"Икономовски",smerID:"212",zvanje:"Дипломирани инжењер електротехнике и рачунарства",godina:"2014",mentor:"Др Десимир Вучић",tema_rada:"UWB когнитивни радио"},
      {id:"5687",ime:"Милан",prezime:"Глухић",smerID:"212",zvanje:"Дипломирани инжењер електротехнике и рачунарства",godina:"2014",mentor:"Др Ђорђе Бабић",tema_rada:"Алати за симулацију рачунарских мрежа у едукацији и истраживању - OMNeT++"},
      {id:"5688",ime:"Дуња",prezime:"Мајсторовић",smerID:"212",zvanje:"Дипломирани инжењер електротехнике и рачунарства",godina:"2014",mentor:"Др Ђорђе Бабић",tema_rada:"Електронско гласање и идентитет"},
      {id:"6363",ime:"Филип",prezime:"Живановић",smerID:"218",zvanje:"Струковни инжењер електротехнике и рачунарства",godina:"2021",mentor:"",tema_rada:""},
      {id:"6364",ime:"Мариано",prezime:"Субан",smerID:"211",zvanje:"Дипломирани информатичар",godina:"2021",mentor:"др Милош Раденковић",tema_rada:"Развој система за генерисање персонализованих тестова компатабилних са Moodle платформом коришћењем Ruby on Rails framework-a"},
      {id:"6365",ime:"Марко",prezime:"Вешовић",smerID:"211",zvanje:"Мастер информатичар",godina:"2022",mentor:"др Горан Ракочевић",tema_rada:"Džon Konvejeva Igra života"},
      {id:"6366",ime:"Јован",prezime:"Гавриловић",smerID:"211",zvanje:"Дипломирани информатичар",godina:"2022",mentor:"Др Душан Вујошевић",tema_rada:"Управљање ризицима у рачунарству"},
      {id:"6367",ime:"Филип",prezime:"Крстић ",smerID:"211",zvanje:"Дипломирани информатичар",godina:"2022",mentor:"Др Душан Вујошевић",tema_rada:"Кућна аутоматизација у ери Интернета ствари"},
      {id:"6368",ime:"Ладо",prezime:"Тадић",smerID:"211",zvanje:"Дипломирани инжењер рачунарства",godina:"2008",mentor:"Др Ранко Бабић",tema_rada:"3D графички интерфејс"},
      {id:"6369",ime:"Ненад",prezime:"Ђурђевић",smerID:"212",zvanje:"Дипломирани инжењер електротехнике и рачунарства",godina:"2022",mentor:"Др Душан Вујошевић",tema_rada:"Преглед актуелних решења за управљање пројектима и анализа њихове популарности"},
      {id:"6370",ime:"Никола",prezime:"Тасић",smerID:"211",zvanje:"Дипломирани информатичар",godina:"2022",mentor:"др Ирена Јовановић",tema_rada:"Анализа фазних прелаза Потсовог модела применом Monte Carlo симулације"},
      {id:"6371",ime:"Александар",prezime:"Икономовски",smerID:"212",zvanje:"Дипломирани инжењер електротехнике и рачунарства",godina:"2022",mentor:"др Петар Бојовић",tema_rada:"Интер-вендорско  тестирање мрежних технологија у виртуелном окружењу"},
      {id:"6372",ime:"Бошко",prezime:"Југовић",smerID:"218",zvanje:"Струковни инжењер електротехнике и рачунарства",godina:"2022",mentor:"",tema_rada:""},
      {id:"6373",ime:"Петар",prezime:"Арнаутовић",smerID:"212",zvanje:"Дипломирани инжењер електротехнике и рачунарства",godina:"2022",mentor:"Др Јелена Васиљевић",tema_rada:"Kласификација пнеуномонијалних налаза са конволутивним неуронским мрежама"},
      {id:"6374",ime:"Милан",prezime:"Убипарип",smerID:"212",zvanje:"Дипломирани инжењер електротехнике и рачунарства",godina:"2022",mentor:"Др Селена Вукотић",tema_rada:"Преглед JPEG стандарда за компресију слика"},
      {id:"6375",ime:"Маја",prezime:"Јеремић",smerID:"212",zvanje:"Дипломирани инжењер електротехнике и рачунарства",godina:"2022",mentor:"Др Душан Вујошевић",tema_rada:"Скрам методологија-Примена и ставови корисника"},
      {id:"6376",ime:"Наташа",prezime:"Лазић",smerID:"212",zvanje:"Дипломирани инжењер електротехнике и рачунарства",godina:"2022",mentor:"др Бојана Димић Сурла",tema_rada:"Имплементација едукативне апликације за Андроид платформу"},
      {id:"6377",ime:"Тодор",prezime:"Михајловић",smerID:"211",zvanje:"Дипломирани информатичар",godina:"2022",mentor:"др Немања Радосављевић",tema_rada:"Транзиција монолтних апликација са традиционалне hosted на инфраструктуру у облаку"},
      {id:"6378",ime:"Александра",prezime:"Митић",smerID:"211",zvanje:"Дипломирани информатичар",godina:"2022",mentor:"Др Милан Видаковић",tema_rada:"Развој апликације за дигитално потписивање докумената коришћењем Etherium blockchain  платформе"},
      {id:"6379",ime:"Богдан",prezime:"Ћирић",smerID:"211",zvanje:"Дипломирани информатичар",godina:"2022",mentor:"Др Видаковић Милан",tema_rada:"Razvoj veb aplikacije za upravljanje inventarom gotovih proizvoda u maloprodaji malih preduzeća"},
      {id:"6380",ime:"Дејан",prezime:"Бојовић",smerID:"218",zvanje:"Струковни инжењер електротехнике и рачунарства",godina:"2022",mentor:"Др Снежана Поповић",tema_rada:"Израда single page апликације у JavaScript-u"},
      {id:"6381",ime:"Никола",prezime:"Машуловић",smerID:"211",zvanje:"Дипломирани информатичар",godina:"2022",mentor:"др Немања Радосављевић",tema_rada:"Апликација за резеравацију наставе (ReactJS)"},
      {id:"6382",ime:"Александар",prezime:"Огризовић",smerID:"211",zvanje:"Дипломирани информатичар",godina:"2022",mentor:"др Бојана Димић Сурла",tema_rada:" Имплементација NFT колекције на Ethereum мрежи"},
      {id:"6383",ime:"Мина",prezime:"Степановић",smerID:"823",zvanje:"Дипломирани дизајнер",godina:"2022",mentor:"",tema_rada:""},
      {id:"6384",ime:"Исидора",prezime:"Комленовић",smerID:"823",zvanje:"Дипломирани дизајнер",godina:"2022",mentor:"",tema_rada:""},
      {id:"6385",ime:"Јелена",prezime:"Вишњички ",smerID:"823",zvanje:"Дипломирани дизајнер",godina:"2022",mentor:"",tema_rada:""},
      {id:"6386",ime:"Александар",prezime:"Пурхмајер",smerID:"823",zvanje:"Дипломирани дизајнер",godina:"2022",mentor:"",tema_rada:""},
      {id:"6387",ime:"Теодора",prezime:"Самарџић",smerID:"823",zvanje:"Дипломирани дизајнер",godina:"2022",mentor:"",tema_rada:""},
      {id:"6388",ime:"Матија",prezime:"Рундић",smerID:"823",zvanje:"Дипломирани дизајнер",godina:"2022",mentor:"",tema_rada:""},
      {id:"6389",ime:"Антоније",prezime:"Карин",smerID:"823",zvanje:"Дипломирани дизајнер",godina:"2022",mentor:"",tema_rada:""},
      {id:"6390",ime:"Дејан",prezime:"Тошић",smerID:"823",zvanje:"Дипломирани дизајнер",godina:"2022",mentor:"",tema_rada:""},
      {id:"6391",ime:"Александар",prezime:"Котурановић",smerID:"823",zvanje:"Дипломирани дизајнер",godina:"2022",mentor:"",tema_rada:""},
      {id:"6392",ime:"Вероника",prezime:"Милић",smerID:"823",zvanje:"Дипломирани дизајнер",godina:"2022",mentor:"",tema_rada:""},
      {id:"6393",ime:"Катарина",prezime:"Добријевић Ескобар",smerID:"823",zvanje:"Дипломирани дизајнер",godina:"2022",mentor:"",tema_rada:""},
      {id:"6394",ime:"Маријана",prezime:"Ристић",smerID:"218",zvanje:"Струковни инжењер електротехнике и рачунарства",godina:"2022",mentor:"Милош Милосављевић",tema_rada:"Предвиђање срчаних болести путем алгоритама машинског учења"},
      {id:"6397",ime:"Стефан",prezime:"Петровић",smerID:"218",zvanje:"Струковни инжењер електротехнике и рачунарства",godina:"2021",mentor:"",tema_rada:""},
      {id:"6398",ime:"Александар",prezime:"Стаматов",smerID:"218",zvanje:"Струковни инжењер електротехнике и рачунарства",godina:"2016",mentor:"",tema_rada:""},
      {id:"6399",ime:"Сања",prezime:"Васиљковић",smerID:"211",zvanje:"Мастер информатичар",godina:"2022",mentor:"Др Јелена Васиљевић",tema_rada:"Генетски алгоритми у музици"},
      {id:"6400",ime:"Адријана",prezime:"Јеремић",smerID:"211",zvanje:"Дипломирани информатичар",godina:"2022",mentor:"Др Јелена Васиљевић",tema_rada:"Генетски алгоритми у биоинформатици"},
      {id:"6401",ime:"Теодора",prezime:"Стевановић",smerID:"211",zvanje:"Дипломирани информатичар",godina:"2022",mentor:"Др Душан Вујошевић",tema_rada:"Компајлерска стуктура LLVM и њена имплементација у оквиру пројекта „Олакшати живот старијим особама коришћењем технологије Интернет од ствари“"},
      {id:"6402",ime:"Милан",prezime:"Бојић",smerID:"211",zvanje:"Дипломирани информатичар",godina:"2022",mentor:"др Немања Илић",tema_rada:"Квантно машинско учење"},
      {id:"6403",ime:"Ален",prezime:"Акиф",smerID:"211",zvanje:"Дипломирани информатичар",godina:"2022",mentor:"Др Душан Вујошевић",tema_rada:"Анализа подухвата лансирања апликације за резервације у угоститељству “ Klub Gou ” помоћу технике lin kanvas"},
      {id:"6404",ime:"Стефан",prezime:"Кеглић",smerID:"218",zvanje:"Струковни инжењер електротехнике и рачунарства",godina:"2022",mentor:"",tema_rada:""},
      {id:"6405",ime:"Вељко",prezime:"Јевтић",smerID:"218",zvanje:"Струковни инжењер електротехнике и рачунарства",godina:"2022",mentor:"",tema_rada:""},
      {id:"6406",ime:"Тијана",prezime:"Медан",smerID:"212",zvanje:"Дипломирани инжењер електротехнике и рачунарства",godina:"2022",mentor:"Др Јелена Васиљевић",tema_rada:"Утицај вештачке интелигенције на радну снагу"},
      {id:"6407",ime:"Милена",prezime:"Митић",smerID:"211",zvanje:"Дипломирани информатичар",godina:"2022",mentor:"Др Душан Вујошевић",tema_rada:"Истраживање употребљивости корисничког интерфејса информационог система глобалне студентске организације AIESEC"},
      {id:"6408",ime:"Драган",prezime:"Мићић",smerID:"212",zvanje:"Дипломирани инжењер електротехнике и рачунарства",godina:"2022",mentor:"др Ђорђе Бабић",tema_rada:"Ласерска комуникација"},
      {id:"6410",ime:"Димитрије",prezime:"Шејат",smerID:"211",zvanje:"Дипломирани информатичар",godina:"2022",mentor:"Др Видаковић Милан",tema_rada:"Рентер - систем за изнајмљивање возила"},
      {id:"6411",ime:"Милена",prezime:"Димитријевић",smerID:"211",zvanje:"Дипломирани информатичар",godina:"2022",mentor:"др Бојана Димић Сурла",tema_rada:"JavaFX апликација за расподелу наставе - од имплементације до продукције"},
      {id:"6412",ime:"Катарина",prezime:"Илић",smerID:"823",zvanje:"Дипломирани дизајнер",godina:"2022",mentor:"",tema_rada:""},
      {id:"6413",ime:"Ивона",prezime:"Вујацков",smerID:"823",zvanje:"Дипломирани дизајнер",godina:"2022",mentor:"",tema_rada:""},
      {id:"6414",ime:"Сара",prezime:"Стојковић",smerID:"823",zvanje:"Дипломирани дизајнер",godina:"2022",mentor:"",tema_rada:""},
      {id:"6415",ime:"Николета",prezime:"Малајмаре",smerID:"823",zvanje:"Дипломирани дизајнер",godina:"2022",mentor:"",tema_rada:""},
      {id:"6416",ime:"Александра",prezime:"Мицић",smerID:"823",zvanje:"Дипломирани дизајнер",godina:"2022",mentor:"",tema_rada:""},
      {id:"6417",ime:"Хелена",prezime:"Кечан",smerID:"823",zvanje:"Дипломирани дизајнер",godina:"2022",mentor:"",tema_rada:""},
      {id:"6418",ime:"Владимир",prezime:"Цветковић",smerID:"212",zvanje:"Дипломирани инжењер електротехнике и рачунарства",godina:"2022",mentor:"Др Мирјана Радивојевић",tema_rada:"Трендови имплементације технологије рачунарства у облаку"},
      {id:"6420",ime:"Николина",prezime:"Вранеш",smerID:"211",zvanje:"Дипломирани информатичар",godina:"2022",mentor:"Др Јелена Васиљевић",tema_rada:"Алгоритми интелигенције роја"},
      {id:"6421",ime:"Лука",prezime:"Ђурић",smerID:"211",zvanje:"Дипломирани информатичар",godina:"2022",mentor:"др Бојана Димић Сурла",tema_rada:"Обрасци комуникације у микросервисној архитектури"},
      {id:"6422",ime:"Иво",prezime:"Мартиновић",smerID:"212",zvanje:"Дипломирани инжењер електротехнике и рачунарства",godina:"2022",mentor:"др Ђорђе Бабић",tema_rada:"Имплементација CI\/CD процеса за Java Spring апликацију"},
      {id:"6423",ime:"Вања",prezime:"Матовић",smerID:"211",zvanje:"Дипломирани информатичар",godina:"2022",mentor:"др Немања Илић",tema_rada:"Препознавање позе објекта помоћу модела дубоког учења за рачунарску визију"},
      {id:"6424",ime:"Андреј",prezime:"Гашић",smerID:"211",zvanje:"Дипломирани информатичар",godina:"2022",mentor:"др Бојана Димић Сурла",tema_rada:"Претраживач метаподатака научних радова - прототип веб апликације"},
      {id:"6425",ime:"Његован",prezime:"Миловић",smerID:"212",zvanje:"Дипломирани инжењер електротехнике и рачунарства",godina:"2022",mentor:"др Петар Бојовић",tema_rada:"Имплементација RAF data centra применом open source виртуелизационих решења"},
      {id:"6426",ime:"Филип",prezime:"Гунић",smerID:"211",zvanje:"Дипломирани информатичар",godina:"2022",mentor:"др Горан Ракочевић",tema_rada:"Примена дубоког учења у биоинформатици"}
    ]
    , {});
  },

  async down (queryInterface, Sequelize) {
    /**
     * Add commands to revert seed here.
     *
     * Example:
     * await queryInterface.bulkDelete('People', null, {});
     */
    await queryInterface.bulkDelete('Student', null, {});
  }
};
